neveenstra/Chordex/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 8MB OPI PSRAM on the ESP32-S3R8 used by the S3-Touch-LCD-1.47
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# 16MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# USB device — TinyUSB MIDI class. The board enumerates as "Chordex" so a
# host computer can route MIDI to it for chord detection.
CONFIG_TINYUSB_MIDI_COUNT=1

# Route console to UART so it doesn't fight TinyUSB for GPIO 19/20.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# LVGL — byte swap matches the Tick-Tac reference config.
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
